*** crates/amplihack-cli/src/commands/session_tree/mod.rs:111:5: replace now_secs -> u64 with 1

*** mutation diff:
--- crates/amplihack-cli/src/commands/session_tree/mod.rs
+++ replace now_secs -> u64 with 1
@@ -103,20 +103,17 @@
         tree_id,
         depth,
         max_depth,
         max_sessions,
     }
 }
 
 fn now_secs() -> u64 {
-    SystemTime::now()
-        .duration_since(UNIX_EPOCH)
-        .map(|d| d.as_secs())
-        .unwrap_or(0)
+    1 /* ~ changed by cargo-mutants ~ */
 }
 
 fn random_id() -> String {
     uuid::Uuid::new_v4().simple().to_string()[..8].to_string()
 }
 
 /// Public entry point dispatched from `commands::dispatch`.
 pub fn run(cmd: SessionTreeCommands) -> Result<()> {


